{
    "Coleus scutellarioides": "Used in traditional medicine for treating digestive issues.",
    "Phyllanthus niruri": "Known for its use in treating kidney stones and liver-related diseases.",
    "Corchorus olitorius": "Commonly used as a leafy vegetable and for its medicinal properties.",
    "Momordica charantia": "Popularly used for its blood sugar-lowering effects.",
    "Euphorbia hirta": "Traditionally used to treat respiratory tract infections.",
    "Curcuma longa": "Widely known for its anti-inflammatory and antioxidant properties.",
    "Carmona retusa": "Often used in bonsai, with some medicinal uses in Asia.",
    "Senna alata": "Commonly used to treat fungal infections on the skin.",
    "Mentha cordifolia Opiz": "Used in culinary dishes and for its soothing effects on the digestive system.",
    "Capsicum frutescens": "Known for its spicy fruit, commonly used in food and as a natural remedy.",
    "Hibiscus rosa-sinensis": "Often used in hair care products and traditional medicines.",
    "Jatropha curcas": "Used in traditional medicine and for producing biofuel.",
    "Ocimum basilicum": "Commonly known as basil, widely used in cooking and herbal remedies.",
    "Nerium oleander": "Toxic plant with historical medicinal uses; caution is advised.",
    "Pandanus amaryllifolius": "Used in Southeast Asian cooking for its fragrant leaves.",
    "Aloe barbadensis Miller": "Popularly known as Aloe Vera, used for skin care and healing burns.",
    "Lagerstroemia speciosa": "Used in traditional medicine for treating diabetes.",
    "Averrhoea bilimbi": "Used in traditional cuisine and medicine for its sour fruit.",
    "Annona muricata": "Known for its cancer-fighting properties and use in traditional medicine.",
    "Citrus aurantiifolia": "Used in cooking, beverages, and traditional medicine for its vitamin C content.",
    "Premna odorata": "Traditionally used to treat respiratory problems and inflammation.",
    "Psidium guajava": "Guava leaves are used for treating digestive issues and diarrhea.",
    "Gliricidia sepium": "Used as a green manure and animal fodder, with some medicinal uses.",
    "Citrus sinensis": "Oranges are widely consumed for their vitamin C and antioxidant properties.",
    "Mangifera indica": "Mango leaves are used in traditional medicine to treat diabetes and asthma.",
    "Citrus microcarpa": "Known as calamondin, used in beverages and as a natural remedy.",
    "Impatiens balsamina": "Traditionally used for treating skin inflammations and wounds.",
    "Arachis hypogaea": "Peanut leaves are used as fodder, and peanuts themselves have various uses.",
    "Tamarindus indica": "Tamarind leaves and fruit are used in cooking and for their laxative effects.",
    "Leucaena leucocephala": "Used as fodder and in traditional medicine for treating digestive issues.",
    "Ipomoea batatas": "Sweet potato leaves are edible and used in various cuisines.",
    "Manihot esculenta": "Cassava leaves are consumed in various cultures and have medicinal uses.",
    "Antidesma bunius": "The fruit and leaves are used in traditional medicine for treating diarrhea.",
    "Citrus maxima": "Pomelo leaves are used in traditional medicine and cooking.",
    "Vitex negundo": "Used in traditional medicine for treating respiratory ailments.",
    "Moringa oleifera": "Known as the 'miracle tree' for its nutritional and medicinal properties.",
    "Blumea balsamifera": "Used in traditional medicine for treating colds and respiratory infections.",
    "Origanum vulgare": "Commonly known as oregano, used in cooking and herbal medicine.",
    "Pepromia pellucida": "Used in traditional medicine to treat gout and skin infections.",
    "Centella asiatica": "Used for its wound healing and cognitive-enhancing properties.",
    "Acer palmatum": "Mostly ornamental, with some traditional medicinal uses.",
    "Aesculus chinensis": "Used in traditional medicine for treating vascular disorders.",
    "Albizia julibrissin": "Used in traditional medicine for its calming effects.",
    "Aloevera": "Known for its skin-healing properties and use in cosmetics.",
    "Amruthaballi": "Used in Ayurvedic medicine to treat diabetes and boost immunity.",
    "Arali": "Traditionally used in treating digestive and respiratory ailments.",
    "Astma_weed": "Used in traditional medicine to treat asthma and respiratory problems.",
    "Bamboo": "Bamboo leaves have various traditional uses, including in herbal medicine.",
    "Beans": "Bean leaves are edible and used in various cuisines.",
    "Betel": "Betel leaves are chewed and used in traditional medicine in many cultures.",
    "Bhrami": "Used in Ayurvedic medicine to improve cognitive function.",
    "Camptotheca acuminata": "Known for its potential anti-cancer properties.",
    "Castor": "Castor leaves are used in traditional medicine and oil extraction.",
    "Catharanthus": "Known for its medicinal properties, including treating diabetes.",
    "Cedrus deodara": "Used in traditional medicine for its anti-inflammatory properties.",
    "Celtis sinensis": "Leaves are used in traditional medicine for treating hypertension.",
    "Cinnamomum camphora (Linn) Presl": "Camphor tree leaves are used in traditional medicine and for their aroma.",
    "Citron lime (herelikai)": "Used in cooking and traditional medicine for its sour fruit.",
    "Coffee": "Coffee leaves are sometimes used in traditional remedies.",
    "Coriender": "Coriander leaves are widely used in cooking and have medicinal properties.",
    "Curry": "Curry leaves are used in cooking and have numerous health benefits.",
    "Doddpathre": "Used in traditional medicine to treat coughs and colds.",
    "Ekka": "Used in traditional medicine for its anti-inflammatory properties.",
    "Elaeocarpus decipiens": "Used in traditional medicine for its calming effects.",
    "Eucalyptus": "Eucalyptus leaves are known for their respiratory and antiseptic benefits.",
    "Euonymus japonicus": "Used in traditional medicine, mainly in East Asia.",
    "Flowering cherry": "Ornamental tree with some traditional medicinal uses.",
    "Ginger": "Ginger leaves and roots are widely used in cooking and traditional medicine.",
    "Ginkgo biloba": "Known for its cognitive-enhancing properties.",
    "Globe Amarnath": "Used in traditional medicine for its anti-inflammatory properties.",
    "Guava": "Guava leaves are used to treat diarrhea and digestive issues.",
    "Henna": "Henna leaves are used for hair dyeing and traditional medicine.",
    "Hibiscus": "Hibiscus leaves and flowers are used in tea and traditional medicine.",
    "Honge": "Used in traditional medicine and as a biodiesel source.",
    "Insulin": "Insulin plant leaves are used to manage diabetes.",
    "Jackfruit": "Jackfruit leaves are used in traditional medicine to treat skin diseases.",
    "Koelreuteria paniculata": "Used in traditional medicine for its anti-inflammatory properties.",
    "Lagerstroemia indica": "Used in traditional medicine for treating diabetes.",
    "Lemon": "Lemon leaves are used in cooking and traditional medicine for their soothing properties.",
    "Liquidambar formosana": "Used in traditional medicine for treating wounds.",
    "Liriodendron chinense": "Ornamental tree with some traditional medicinal uses.",
    "Loropetalum chinense var. rubrum": "Used in traditional medicine in Asia.",
    "Magnolia grandiflora L": "Known for its calming and anti-inflammatory properties.",
    "Magnolia liliflora Desr": "Used in traditional medicine for its anti-inflammatory effects.",
    "Malushalliana": "Mostly ornamental, with some traditional medicinal uses.",
    "Mango": "Mango leaves are used in traditional medicine to treat diabetes and respiratory issues.",
    "Marigold": "Used in traditional medicine for its anti-inflammatory and wound-healing properties.",
    "Michelia chapensis": "Used in traditional medicine for its anti-inflammatory effects.",
    "Mint": "Mint leaves are widely used in cooking and traditional remedies for digestive issues.",
    "Neem": "Neem leaves are used in traditional medicine for their antibacterial properties.",
    "Nelavembu": "Used in traditional medicine to treat fever and infections.",
    "Onion": "Onion leaves are used in cooking and traditional remedies.",
    "Osmanthus fragrans": "Used in traditional medicine and as a fragrant in teas.",
    "Palak(Spinach)": "Spinach leaves are rich in nutrients and used in various dishes.",
    "Papaya": "Papaya leaves are used in traditional medicine to treat dengue fever.",
    "Photinia serratifolia": "Ornamental plant with some traditional medicinal uses.",
    "Platanus": "Ornamental tree with traditional medicinal uses for treating skin issues.",
    "Populus L": "Used in traditional medicine for its anti-inflammatory properties.",
    "Prunus persica": "Peach leaves are used in traditional medicine for treating respiratory ailments.",
    "Pumpkin": "Pumpkin leaves are edible and used in various dishes.",
    "Rose": "Rose leaves and petals are used in traditional medicine and cosmetics.",
    "Salix babylonica": "Known for its pain-relieving properties, used in traditional medicine.",
    "Sapindus saponaria": "Used in traditional medicine and as a natural soap.",
    "Seethapala": "Custard apple leaves are used in traditional medicine to treat fever.",
    "Styphnolobium japonicum": "Used in traditional medicine for treating bleeding disorders.",
    "Tamarind": "Tamarind leaves are used in cooking and traditional medicine.",
    "Triadica sebifera": "Used in traditional medicine and for making candles.",
    "Tulsi": "Known for its immune-boosting and respiratory benefits.",
    "Zelkova serrata": "Ornamental tree with some traditional medicinal uses.",
    "ashoka": "Used in traditional medicine for treating gynecological problems."
}